{
  "fullName": "Rian Akbar Ferdiansyah",
  "profession": "Lead Software Engineer | Frontend & Fullstack Specialist",
  "summary": "Highly driven Software Engineer with 5+ years of experience leading end-to-end development of web and mobile applications. Skilled in React, Next.js, TypeScript, Node.js, Golang, and Java Spring Boot. Proven ability in building scalable architectures, reusable UI libraries, and high-performance systems. Experienced in mentoring engineers, improving processes, and delivering user-focused digital solutions that accelerate business growth.",
  "buttonPrimaryLabel": "Get in Touch",
  "buttonSecondaryLabel": "Download My CV",
  "experience": [
    {
      "period": "JAN 2024 – PRESENT",
      "title": "Fullstack Developer Lead | AIA Indonesia",
      "description": [
        "Spearheaded enhancements on the iRecruit platform, accelerating agent onboarding from 25 days to just 4–6 days.",
        "Partnered with Human-Centered Design and Business Analyst teams to refine flows and improve user experience.",
        "Guided frontend engineers during integration sprints to ensure delivery quality and stability.",
        "Led architecture improvements, reducing technical debt and increasing scalability."
      ],
      "tech": [
        "Vue JS",
        "JavaScript",
        "TypeScript",
        "Pinia",
        "Vuetify",
        "Java",
        "Spring Boot"
      ]
    },
    {
      "period": "APR 2022 – JAN 2024",
      "title": "Senior Frontend Engineer | Majoo Indonesia",
      "description": [
        "Owned and led the development of @majoo-ui/react, a centralized React design system adopted by 30+ engineers.",
        "Established coding standards, reusable component libraries, and extensive documentation for faster onboarding.",
        "Enhanced maintainability and test coverage while improving dashboard performance.",
        "Mentored junior engineers and collaborated with Product and Design for cross-team alignment."
      ],
      "tech": [
        "React JS",
        "JavaScript",
        "TypeScript",
        "Redux",
        "Storybook",
        "Radix UI",
        "Stitches"
      ]
    },
    {
      "period": "MAR 2021 – APR 2022",
      "title": "Frontend Engineer | Dattabot",
      "description": [
        "Transformed analytical data into visually rich dashboards with interactive charts and maps.",
        "Integrated digital signature and e-stamp modules for secure, user-friendly workflows.",
        "Optimized development productivity using Redux Toolkit and TypeScript.",
        "Conducted internal workshops on TypeScript and Redux Toolkit for cross-department engineers."
      ],
      "tech": [
        "React JS",
        "Next JS",
        "JavaScript",
        "TypeScript",
        "Redux Toolkit",
        "Google Maps API",
        "Ant Design",
        "Tailwind CSS",
        "Chart JS"
      ]
    },
    {
      "period": "JUN 2020 – MAR 2021",
      "title": "Frontend Engineer | NashTa Global Utama",
      "description": [
        "Developed Microfrontend architecture to enable modular apps and clear feature ownership.",
        "Integrated GraphQL for flexible data fetching and reduced redundant API calls.",
        "Built responsive UIs optimized across devices with thorough unit testing.",
        "Improved code maintainability and reliability through automated testing."
      ],
      "tech": [
        "React JS",
        "Next JS",
        "JavaScript",
        "TypeScript",
        "Redux",
        "Jest",
        "React Testing Library",
        "GraphQL",
        "Bootstrap"
      ]
    }
  ],
  "projects": [
    {
      "title": "CEISA 4.0 | Indonesian Customs",
      "description": "A national web portal for the Directorate General of Customs, providing millions of users with secure and efficient access to customs and excise services.",
      "image": "project-bea-cukai"
    },
    {
      "title": "My IndiHome | Telkomsel",
      "description": "A customer platform that allows subscribers to manage accounts, track internet usage, and pay bills seamlessly—enhancing nationwide digital adoption.",
      "image": "project-my-indihome"
    },
    {
      "title": "Majoo Dashboard | Majoo Indonesia",
      "description": "An integrated SaaS dashboard offering Point of Sales, Inventory Management, Accounting, and Online Store capabilities, enabling SMEs with real-time insights and operations.",
      "image": "project-majoo-dashboard"
    },
    {
      "title": "iRecruit | AIA Indonesia",
      "description": "A recruitment platform streamlining agent onboarding, reducing timelines from 25 days to just 4–6 days, while delivering an improved and seamless user experience.",
      "image": "project-aia-indonesia"
    }
  ]
}
